Repository: blackdwarf/cli
Catalog: src/dotnet/commands/dotnet-add/dotnet-add-p2p/xlf/LocalizableStrings.*.xlf
Languages: es, pl, pt_br, tr, zh_hant

# SpecifyAtLeastOneReferenceToAdd
source: You must specify at least one reference to add. Please run dotnet add --help for more information.
es: Debe especificar al menos una referencia para agregar. Ejecute dotnet add --help para obtener más información.
pl: Musisz określić co najmniej jedno odwołanie do dodania. Uruchom polecenie dotnet add --help, aby uzyskać więcej informacji.
pt_br: É necessário especificar pelo menos uma referência para ser adicionada. Execute dotnet add --help para obter mais informações.
tr: Eklemek için en az bir başvuru belirtmeniz gerekir. Daha fazla bilgi için lütfen dotnet add --help komutunu çalıştırın.
zh_hant: 您必須至少指定一個要新增的參考。如需詳細資訊，請執行 dotnet add --help。

# AppFullName
source: .NET Add Project to Project (p2p) reference Command
es: Comando de .NET para agregar una referencia de proyecto a proyecto (p2p)
pl: Polecenie dodawania odwołania między projektami (p2p) dla platformy .NET
pt_br: Comando Add Project to Project (p2p) reference do .NET
tr: .NET Add Project to Project (p2p) reference Komutu
zh_hant: .NET 新增專案對專案 (p2p) 參考命令

# AppDescription
source: Command to add project to project (p2p) reference
es: Comando para agregar una referencia de proyecto a proyecto (p2p)
pl: Polecenie służące do dodania odwołania między projektami (p2p)
pt_br: Comando para adicionar a referência p2p (projeto para projeto)
tr: Projeden projeye (p2p) başvuru ekleme komutu
zh_hant: 用以新增專案對專案 (p2p) 參考的命令

# AppHelpText
source: Project to project references to add
es: Referencias de proyecto a proyecto para agregar
pl: Odwołania między projektami, które mają zostać dodane
pt_br: Referências de projeto para projeto a serem adicionadas
tr: Eklenecek olan, projeden projeye başvurular
zh_hant: 要新增的專案對專案參考

# CmdProject
source: PROJECT
es: PROYECTO
pl: PROJEKT
pt_br: PROJETO
tr: PROJE
zh_hant: 專案

# CmdProjectDescription
source: The project file to modify. If a project file is not specified, it searches the current working directory for an MSBuild file that has a file extension that ends in `proj` and uses that file.
es: Archivo del proyecto que se va a modificar. Si no se especifica un archivo del proyecto, busca en el directorio de trabajo actual un archivo MSBuild que tenga una extensión de archivo que acabe en “proj” y utiliza ese archivo.
pl: Plik projektu do zmodyfikowania. Jeśli nie określono pliku projektu, w bieżącym katalogu roboczym zostanie wyszukany i użyty plik programu MSBuild, którego rozszerzenie kończy się na „proj”.
pt_br: O arquivo de projeto a ser modificado. Se não houver arquivo de projeto especificado, ele pesquisará no diretório de trabalho atual um arquivo do MSBuild que contenha uma extensão de arquivo que termine em ‘proj’ e usará esse arquivo.
tr: Değiştirilecek proje dosyası. Bir proje dosyası belirtilmezse, geçerli çalışma dizininde dosya uzantısının sonu ‘proj’ olan bir MSBuild dosyası arar ve bu dosyayı kullanır.
zh_hant: 要修改的專案檔。若未指定專案檔，則會在目前的工作目錄搜尋副檔名以 `proj` 結尾的 MSBuild 檔案，並使用該檔案。

# CmdFramework
source: FRAMEWORK
es: PLATAFORMA
pl: PLATFORMA
pt_br: ESTRUTURA
tr: ÇERÇEVE
zh_hant: 架構

# CmdFrameworkDescription
source: Add reference only when targetting a specific framework
es: Se agrega una referencia solo cuando hay una plataforma de destino específica
pl: Dodaj odwołanie tylko w przypadku określenia konkretnej platformy docelowej
pt_br: Adicionar referência apenas ao visar uma estrutura específica
tr: Yalnızca belirli bir çerçeveyi hedeflerken başvuru ekler
zh_hant: 只有在以特定架構為目標時才新增參考

# CmdForceDescription
source: Add reference even if it does not exist, do not convert paths to relative
es: Se agrega una referencia incluso si no existe, las rutas de acceso no se convierten en relativas
pl: Dodaj odwołanie, nawet jeśli nie istnieje; nie konwertuj ścieżek na względne
pt_br: Adicionar a referência se ela não existir, não converter os caminhos para relativos
tr: Mevcut olmasa bile başvuru ekler, yolları göreli yola dönüştürmez
zh_hant: 即使不存在也新增參考，請勿將路徑轉換成相對路徑

# ProjectException
source: Project
es: Proyecto
pl: Projekt
pt_br: Projeto
tr: Proje
zh_hant: 專案
