Repository: blackdwarf/cli
Catalog: src/dotnet/commands/dotnet-remove/xlf/LocalizableStrings.*.xlf
Languages: es

source: .NET Remove Command
es: Comando Remove de .NET

source: Usage
es: Uso

source: Options
es: Opciones

# HelpDefinition
source: Show help information
es: Muestra información de ayuda

source: Arguments
es: Argumentos

# ArgumentsObjectDefinition
source: The object of the operation. If a project file is not specified, it defaults to the current directory.
es: Objeto de la operación. Si no se especifica un archivo del proyecto, usa el directorio actual de forma predeterminada.

# ArgumentsCommandDefinition
source: Command to be executed on <object>.
es: Comando para ejecutar en <objeto>.

# ArgsDefinition
source: Any extra arguments passed to the command. Use `dotnet add <command> --help` to get help about these arguments.
es: Argumentos adicionales que se pasan al comando. Use “dotnet add <comando> --help” para obtener ayuda sobre estos argumentos.

source: Commands
es: Comandos

# CommandP2PDefinition
source: Remove project to project (p2p) reference from a project
es: Quita una referencia de proyecto a proyecto (p2p) de un proyecto
