Repository: blackdwarf/cli
Catalog: src/dotnet/commands/dotnet-remove/dotnet-remove-p2p/xlf/LocalizableStrings.*.xlf
Languages: de, fr, it, ja, ko, pl, pt_br, ru, zh_hans

# AppFullName
source: .NET Remove Project to Project (p2p) reference Command
de: .NET-Befehl zum Entfernen von Projekt-zu-Projekt-Verweisen (P2P-Verweise)
fr: Commande de suppression d'une référence projet à projet (p2p) .NET
it: Comando Rimuovi riferimento P2P (da progetto a progetto) .NET
ja: .NET Remove Project to Project (p2p) 参照コマンド
ko: .NET p2p(프로젝트 간) 참조 제거 명령
pl: Polecenie usuwania odwołania między projektami (p2p) dla platformy .NET
pt_br: Comando .NET Remove Project to Project (p2p) reference
ru: Команда .NET "Удалить ссылку проекта на проект (p2p)"
zh_hans: 用于项目到项目(p2p)引用的 .NET 删除命令

# AppDescription
source: Command to remove project to project (p2p) reference
de: Befehl zum Entfernen von Projekt-zu-Projekt-Verweisen (P2P-Verweise)
fr: Commande permettant de supprimer une référence projet à projet (p2p)
it: Comando per rimuovere il riferimento P2P (da progetto a progetto)
ja: project to project (p2p) 参照を削除するコマンド
ko: p2p(프로젝트 간) 참조를 제거하는 명령입니다.
pl: Polecenie służące do usuwania odwołania między projektami (p2p)
pt_br: Comando para remover a referência p2p (projeto para projeto)
ru: Команда для удаления ссылки проекта на проект (p2p).
zh_hans: 用于删除项目到项目(p2p)引用的命令

# AppArgumentSeparatorHelpText
source: Project to project references to remove
de: Zu entfernender Projekt-zu-Projekt-Verweis
fr: Références projet à projet à supprimer
it: Riferimenti P2P (da progetto a progetto) da rimuovere
ja: 削除する project to project 参照
ko: 제거할 프로젝트 간 참조입니다.
pl: Odwołania między projektami, które mają zostać usunięte
pt_br: Referências de projeto para projeto a serem removidas
ru: Удаляемая ссылка проекта на проект
zh_hans: 要删除的项目到项目引用

# CmdArgProject
source: PROJECT
fr: PROJET
it: PROGETTO
pl: PROJEKT
pt_br: PROJETO

# CmdArgumentDescription
source: The project file to modify. If a project file is not specified, it searches the current working directory for an MSBuild file that has a file extension that ends in `proj` and uses that file.
de: Die zu ändernde Projektdatei. Ist keine Projektdatei angegeben, wird das aktuelle Arbeitsverzeichnis nach einer Datei mit einer Dateierweiterung durchsucht, die auf "proj" endet. Diese Datei wird dann verwendet.
fr: Fichier projet à modifier. Si aucun fichier projet n'est spécifié, il recherche dans le répertoire de travail actif un fichier dont l'extension se termine par 'proj' et utilise ce dernier.
it: File di progetto da modificare. Se non si specifica un file di progetto, nella directory di lavoro corrente verrà cercato un file MSBuild la cui estensione termina con `proj` e verrà usato tale file.
ja: 修正するプロジェクト ファイル。プロジェクト ファイルを指定しなかった場合、現在の作業ディレクトリの中から "proj" で終わるファイル拡張子を持つ MSBuild ファイルを検索し、そのファイルを使用します。
ko: 수정할 프로젝트 파일입니다. 프로젝트 파일을 지정하지 않으면 현재 작업 디렉터리에서 파일 확장명이 ‘proj’로 끝나는 MSBuild 파일을 찾아서 사용합니다.
pl: Plik projektu do zmodyfikowania. Jeśli nie określono pliku projektu, w bieżącym katalogu roboczym zostanie wyszukany i użyty plik programu MSBuild, którego rozszerzenie kończy się na „proj”.
pt_br: O arquivo de projeto a ser modificado. Se não houver arquivo de projeto especificado, ele pesquisará no diretório de trabalho atual um arquivo do MSBuild que contenha uma extensão de arquivo que termine em ‘proj’ e usará esse arquivo.
ru: Изменяемый файл проекта. Если файл проекта не указан, MSBuild выполняет в текущем рабочем каталоге поиск файла с расширением, оканчивающимся на PROJ, и использует этот файл.
zh_hans: 要修改的项目文件。如果未指定项目文件，将搜索当前工作目录来查找文件扩展名以“proj”结尾的 MSBuild 文件并使用该文件。

# CmdFramework
source: FRAMEWORK
pl: PLATFORMA
pt_br: ESTRUTURA

# CmdFrameworkDescription
source: Remove reference only when targetting a specific framework
de: Verweis nur bei Verwendung eines bestimmten Zielframeworks entfernen
fr: Supprimer la référence uniquement en cas de ciblage d'un framework spécifique
it: Rimuove il riferimento solo se destinato a un framework specifico
ja: 特定のフレームワークを対象とする場合にのみ参照を削除する
ko: 특정 프레임워크를 대상으로 지정할 때에만 참조를 제거합니다.
pl: Usuń odwołanie tylko w przypadku określenia konkretnej platformy docelowej
pt_br: Remover referência apenas ao visar uma estrutura específica
ru: Удалять ссылку только при выборе конкретной целевой платформы
zh_hans: 仅针对特定框架删除引用

# ProjectException
source: Project
de: Projekt
fr: Projet
it: Progetto
ja: プロジェクト
ko: 프로젝트
pl: Projekt
pt_br: Projeto
ru: Проект
zh_hans: 项目

# ReferenceNotFoundInTheProject
source: Specified reference {0} does not exist in project {1}.
de: Der angegebene Verweis "{0}" ist im Projekt "{1}" nicht vorhanden.
fr: La référence spécifiée {0} n'existe pas dans le projet {1}.
it: Il riferimento specificato {0} non esiste nel progetto {1}.
ja: 指定された参照 {0} はプロジェクト {1} に存在しません。
ko: 지정한 참조 {0}이(가) {1} 프로젝트에 없습니다.
pl: Określone odwołanie {0} nie istnieje w projekcie {1}.
pt_br: A referência {0} especificada não existe no projeto {1}.
ru: Указанная ссылка {0} не существует в проекте {1}.
zh_hans: 项目 {1} 中不存在指定的引用 {0}。

# ReferenceRemoved
source: Reference `{0}` deleted from the project.
de: Der Verweis "{0}" wurde aus dem Projekt gelöscht.
fr: Référence '{0}' supprimée du projet.
it: Il riferimento `{0}` è stato eliminato dal progetto.
ja: 参照 `{0}` はプロジェクトから削除されました。
ko: `{0}` 참조가 프로젝트에서 삭제되었습니다.
pl: Odwołanie „{0}” zostało usunięte z projektu.
pt_br: A referência ‘{0}’ foi excluída do projeto.
ru: Ссылка "{0}" удалена из проекта.
zh_hans: 已从项目中删除引用“{0}”。

# SpecifyAtLeastOneReferenceToRemove
source: You must specify at least one reference to delete. Please run dotnet delete --help for more information.
de: Geben Sie mindestens einen zu löschenden Verweis an. Führen Sie "dotnet delete --help" aus, um weitere Informationen zu erhalten.
fr: Vous devez spécifier au moins une référence à supprimer. Exécutez dotnet delete --help pour plus d'informations.
it: È necessario specificare almeno un riferimento da eliminare. Per altre informazioni, eseguire dotnet delete --help.
ja: 削除する参照を少なくとも 1 つ指定する必要があります。詳細については、dotnet delete --help を実行してください。
ko: 삭제할 참조를 하나 이상 지정해야 합니다. 자세한 정보를 보려면 dotnet delete --help를 실행하세요.
pl: Musisz określić co najmniej jedno odwołanie do usunięcia. Uruchom polecenie dotnet delete --help, aby uzyskać więcej informacji.
pt_br: É necessário especificar pelo menos uma referência para ser excluída. Execute dotnet delete --help para obter mais informações.
ru: Необходимо указать по крайней мере одну удаляемую ссылку. Для получения дополнительных сведений выполните команду dotnet delete --help.
zh_hans: 必须至少指定一个要删除的引用。请运行 dotnet delete --help，获取更多信息。

# ReferenceDeleted
source: Reference `{0}` deleted.
de: Der Verweis "{0}" wurde gelöscht.
fr: Référence '{0}' supprimée.
it: Il riferimento `{0}` è stato eliminato.
ja: 参照 `{0}` が削除されました。
ko: `{0}` 참조가 삭제되었습니다.
pl: Odwołanie „{0}” zostało usunięte.
pt_br: A referência ‘{0}’ foi excluída.
ru: Ссылка "{0}" удалена.
zh_hans: 已删除引用“{0}”。

# SpecifyAtLeastOneReferenceToDelete
source: You must specify at least one reference to delete. Please run dotnet delete --help for more information.
de: Geben Sie mindestens einen zu löschenden Verweis an. Führen Sie "dotnet delete --help" aus, um weitere Informationen zu erhalten.
fr: Vous devez spécifier au moins une référence à supprimer. Exécutez dotnet delete --help pour plus d'informations.
it: È necessario specificare almeno un riferimento da eliminare. Per altre informazioni, eseguire dotnet delete --help.
ja: 削除する参照を少なくとも 1 つ指定する必要があります。詳細については、dotnet delete --help を実行してください。
ko: 삭제할 참조를 하나 이상 지정해야 합니다. 자세한 정보를 보려면 dotnet delete --help를 실행하세요.
pl: Musisz określić co najmniej jedno odwołanie do usunięcia. Uruchom polecenie dotnet delete --help, aby uzyskać więcej informacji.
pt_br: É necessário especificar pelo menos uma referência para ser excluída. Execute dotnet delete --help para obter mais informações.
ru: Необходимо указать по крайней мере одну удаляемую ссылку. Для получения дополнительных сведений выполните команду dotnet delete --help.
zh_hans: 必须至少指定一个要删除的引用。请运行 dotnet delete --help，获取更多信息。

source: .NET Remove Command
de: .NET-Befehl "Remove"
fr: Commande de suppression .NET
it: Comando Rimuovi .NET
ja: .NET Remove コマンド
ko: .NET Remove 명령
pl: Polecenie remove platformy .NET
pt_br: Comando .NET Remove
ru: Команда .NET "Удалить"
zh_hans: .NET 删除命令

source: Usage
de: Syntax
fr: Utilisation
it: Utilizzo
ja: 使用法
ko: 사용법
pl: Użycie
pt_br: Uso
ru: Использование
zh_hans: 使用情况

source: Options
de: Optionen
it: Opzioni
ja: オプション
ko: 옵션
pl: Opcje
pt_br: Opções
ru: Параметры
zh_hans: 选项

# HelpDefinition
source: Show help information
de: Hilfeinformationen anzeigen
fr: Afficher des informations d'aide
it: Visualizza la Guida
ja: ヘルプ情報を表示する
ko: 도움말 정보 표시
pl: Wyświetl informacje pomocy
pt_br: Mostrar informações de ajuda
ru: Показать справку
zh_hans: 显示帮助信息

source: Arguments
de: Argumente
it: Argomenti
ko: 인수
pl: Argumenty
pt_br: Argumentos
ru: Аргументы

# ArgumentsObjectDefinition
source: The object of the operation. If a project file is not specified, it defaults to the current directory.
de: Das Objekt des Vorgangs. Ist keine Projektdatei angegeben, wird standardmäßig das aktuelle Verzeichnis verwendet.
fr: Objet de l'opération. Si aucun fichier projet n'est spécifié, le répertoire actif est sélectionné par défaut.
it: Oggetto dell'operazione. Se non è specificato un file di progetto, per impostazione predefinita verrà usata la directory corrente.
ja: 操作のオブジェクト。プロジェクト ファイルを指定しない場合、既定は現在のディレクトリです。
ko: 작업의 개체입니다. 프로젝트 파일을 지정하지 않는 경우 현재 디렉터리로 기본 설정됩니다.
pl: Obiekt operacji. Jeśli nie określono pliku projektu, wartością domyślną jest bieżący katalog.
pt_br: O objeto da operação. Se um arquivo de projeto não for especificado, ele usará o diretório atual como padrão.
ru: Объект операции. Если файл проекта не указан, по умолчанию используется текущий каталог.
zh_hans: 操作的对象。如果未指定项目文件，则默认为当前目录。

# ArgumentsCommandDefinition
source: Command to be executed on <object>.
de: Der für das Objekt auszuführende Befehl.
fr: Commande à exécuter sur <objet>.
it: Comando da eseguire su <oggetto>.
ja: <オブジェクト> で実行されるコマンド。
ko: <개체>에 실행할 명령입니다.
pl: Polecenie, które ma zostać wykonane na obiekcie <obiekt>.
pt_br: O comando a ser executado no <objeto>.
ru: Команда, выполняемая для <объекта>.
zh_hans: 要在 <对象> 上执行的命令。

# ArgsDefinition
source: Any extra arguments passed to the command. Use `dotnet add <command> --help` to get help about these arguments.
de: An den Befehl zu übergebende Zusatzargumente. Weitere Informationen zu diesen Argumenten erhalten Sie mithilfe von "dotnet add <Befehl> --help".
fr: Arguments supplémentaires passés à la commande. Utilisez 'dotnet add <commande> --help' pour obtenir de l'aide sur ces arguments.
it: Eventuali argomenti aggiuntivi passati al comando. Per visualizzare la Guida su questi argomenti, usare `dotnet add <comando> --help`.
ja: コマンドに渡されるすべての他の引数。`dotnet add <command> --help` を使用して、これらの引数に関するヘルプを表示します。
ko: 명령에 전달되는 추가 인수입니다. 이러한 인수에 대한 도움말을 보려면 `dotnet add <명령> --help`를 사용하세요.
pl: Dodatkowe argumenty przekazywane do polecenia. Użyj polecenia „dotnet add <polecenie> --help”, aby uzyskać pomoc dotyczącą tych argumentów.
pt_br: Quaisquer argumentos extras passados para o comando. Use ‘dotnet add <command> --help’ para obter ajuda sobre esses argumentos.
ru: Любые дополнительные аргументы, передаваемые в команду. Используйте команду dotnet add <команда> --help, чтобы получить справочные сведения об этих аргументах.
zh_hans: 传递给命令的任何其他参数。通过“dotnet add <command> --help”获取有关这些参数的帮助。

source: Commands
de: Befehle
fr: Commandes
it: Comandi
ja: コマンド
ko: 명령
pl: Polecenia
pt_br: Comandos
ru: Команды
zh_hans: 命令

# CommandP2PDefinition
source: Remove project to project (p2p) reference from a project
de: Projekt-zu-Projekt-Verweis (P2P-Verweis) aus einem Projekt entfernen
fr: Supprimer une référence projet à projet (p2p) d'un projet
it: Rimuove il riferimento P2P (da progetto a progetto) da un progetto
ja: project to project (p2p) 参照をプロジェクトから削除する
ko: 프로젝트에서 p2p(프로젝트 간) 참조를 제거합니다.
pl: Usuń odwołania między projektami (p2p) z projektu
pt_br: Remover a referência de p2p (projeto para projeto) de um projeto
ru: Удаление ссылки проекта на проект (p2p) из проекта
zh_hans: 从项目中删除项目到项目(p2p)引用
